&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбъектыНазначения") Тогда
		ОбъектыНазначения.ЗагрузитьЗначения(Параметры.ОбъектыНазначения);
	КонецЕсли;
	
	Если ОбъектыНазначения.Количество() Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОбъектыНазначения", ОбъектыНазначения.ВыгрузитьЗначения());
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДескрипторыОбъектовДляВыгрузкиГалактика.F_DESGR КАК Дескриптор
		|ИЗ
		|	РегистрСведений.ДескрипторыОбъектовДляВыгрузкиГалактика КАК ДескрипторыОбъектовДляВыгрузкиГалактика
		|ГДЕ
		|	ДескрипторыОбъектовДляВыгрузкиГалактика.Объект В(&ОбъектыНазначения)";
		
		Дескрипторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Дескриптор");
		Если Дескрипторы.Количество() = 1 Тогда
			Дескриптор = Дескрипторы.Получить(0);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДескрипторНаСервере()
	
	СтруктураЗаписи = Новый Структура("Объект, F_DESGR", Неопределено, ЭтотОбъект.Дескриптор);
	Для Каждого ТекОбъект Из ОбъектыНазначения Цикл
		СтруктураЗаписи.Объект = ТекОбъект.Значение; 
		РегистрыСведений.ДескрипторыОбъектовДляВыгрузкиГалактика.ДобавитьЗапись(СтруктураЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДескриптор(Команда)
	
	УстановитьДескрипторНаСервере();
	Закрыть();
	
КонецПроцедуры