#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура добавляет запись в регистр по переданным значениям структуры.
Процедура ДобавитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "ДескрипторыОбъектовДляВыгрузкиГалактика", Загрузка);
	
КонецПроцедуры

Функция ОбъектЕстьВРегистре(Объект) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.ДескрипторыОбъектовДляВыгрузкиГалактика КАК ДескрипторыОбъектовДляВыгрузкиГалактика
	|ГДЕ
	|	ДескрипторыОбъектовДляВыгрузкиГалактика.Объект = &Объект";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли