&НаСервере
Процедура ДобавитьЗаписьОНезагруженномОбъекте(СтрокаОбработки, ИмяТаблицы, НомерСтека, ОписаниеОшибки) Экспорт
	
	Возврат;
	
	НаборЗаписей = РегистрыСведений.НеЗагруженныеОбъекты.СоздатьНаборЗаписей();
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	
	СтруктураСтека = Новый Структура;
	
	Для Каждого ТекКолонка Из СтрокаОбработки.Владелец().Колонки Цикл
		
		СтруктураСтека.Вставить(ТекКолонка.Имя);
		
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураСтека, СтрокаОбработки);
	
	ЗаписьНабора.СтрокаОбработки = ЗначениеВСтрокуВнутр(СтруктураСтека);
	ЗаписьНабора.ИмяТаблицы = ИмяТаблицы;
	ЗаписьНабора.НомерСтека = НомерСтека; 
	ЗаписьНабора.ОписаниеОшибки = ОписаниеОшибки;
	
	ЗаписьНабора.Период = ТекущаяДата();
	
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры
