Процедура МодификацияФормы(ЭтаФорма) Экспорт
	
	//отказ от обработки 04092016
	Возврат;
	
	ИмяФормы = ЭтаФорма.ИмяФормы;
	Если Не ЗначениеЗаполнено(ИмяФормы) Тогда 
		Возврат;
	КонецЕсли;
	
	Изменения = Неопределено;
	Если ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		Изменения = ПолучитьИзмененияФормы_Документ_ПоступлениеТоваровУслуг_ФормаДокумента();
		
	КонецЕсли;
	
	ИзменитьФорму(ЭтаФорма, Изменения);
	
КонецПроцедуры

Функция ПолучитьИзмененияФормы_Документ_ПоступлениеТоваровУслуг_ФормаДокумента()
	
	ЭлементФормы = Новый Структура("Имя, Тип, Родитель, Заголовок, ПутьКДанным, Вид",
	"ЭлементГалактикаГруппаПользователейСоздавшаяДокумент","ПолеФормы","ГруппаПараметрыПраво","Дескриптор ","Объект.ГалактикаГруппаПользователейСоздавшаяДокумент", ВидПоляФормы.ПолеВвода);
	
	ДобавляемыеЭлементы = Новый Массив;
	
	ДобавляемыеЭлементы.Добавить(ЭлементФормы);
		
	Изменения = Новый Структура;
	
	Изменения.Вставить("ДобавляемыеЭлементы", ДобавляемыеЭлементы);
	
	РедактируемыеЭлементы = ПолучитьОписаниеРедактируемыхЭлементов();
	
	//НоваяСтрока = РедактируемыеЭлементы.Добавить();
	//
	//НоваяСтрока.Имя = "ЭлементГалактикаГруппаПользователейСоздавшаяДокумент"; 
	//НоваяСтрока.Свойство = "МаксимальнаяШирина"; 
	//НоваяСтрока.Значение = 3;
	//НоваяСтрока.Путь = "Элементы"; 
	
	НоваяСтрока = РедактируемыеЭлементы.Добавить();
	
	НоваяСтрока.Имя = "ЭлементГалактикаГруппаПользователейСоздавшаяДокумент"; 
	НоваяСтрока.Свойство = "РастягиватьПоГоризонтали"; 
	НоваяСтрока.Значение = Ложь;
	НоваяСтрока.Путь = "Элементы"; 
	
	Изменения.Вставить("РедактируемыеЭлементы", РедактируемыеЭлементы);
	
	Возврат Изменения;
	
КонецФункции

Функция ПолучитьОписаниеРедактируемыхЭлементов()
	
	РедактируемыеЭлементы = Новый ТаблицаЗначений;
	
	РедактируемыеЭлементы.Колонки.Добавить("Имя");
	РедактируемыеЭлементы.Колонки.Добавить("Свойство");
	РедактируемыеЭлементы.Колонки.Добавить("Значение");
	РедактируемыеЭлементы.Колонки.Добавить("Путь");

	Возврат РедактируемыеЭлементы;
	
КонецФункции

Процедура ИзменитьФорму(ЭтаФорма, Изменения)
	
	Если Изменения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДобавляемыеКоманды = Неопределено;
	ДобавляемыеЭлементы = Неопределено;
	РедактируемыеЭлементы = Неопределено;
	ДобавляемыеРеквизиты = Неопределено;
	
	Изменения.Свойство("ДобавляемыеКоманды",ДобавляемыеКоманды);
	Изменения.Свойство("ДобавляемыеЭлементы",ДобавляемыеЭлементы);
	Изменения.Свойство("РедактируемыеЭлементы",РедактируемыеЭлементы);
	Изменения.Свойство("ДобавляемыеРеквизиты",ДобавляемыеРеквизиты);
	
	Элементы = ЭтаФорма.ЭтотОбъект.Элементы;
		
	Если Не ДобавляемыеРеквизиты = Неопределено Тогда 
		
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 	
		
	КонецЕсли;
	
	Если Не ДобавляемыеКоманды = Неопределено Тогда
		
		Команды =  ЭтаФорма.ЭтотОбъект.Команды;
		
		Для Каждого Команда Из ДобавляемыеКоманды Цикл
			
			НоваяКоманда = Команды.Добавить(Команда.Имя);
			НоваяКоманда.Действие = "КОМИЛЬФО_ГЛОБАЛЬНАЯ_КОМАНДА";
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ДобавляемыеЭлементы = Неопределено Тогда
				
		Для Каждого Элемент Из ДобавляемыеЭлементы Цикл
			
			ЭлементФормы = Элементы.Добавить(Элемент.Имя, Тип(Элемент.Тип), ?(ЗначениеЗаполнено((Элемент.Родитель)),Элементы[Элемент.Родитель],ЭтаФорма));
			ЭлементФормы.Заголовок = Элемент.Заголовок;
			
			Если Элемент.Тип = "ГруппаФормы" Тогда
				
				ЭлементФормы.Вид = Элемент.Вид;
				
			ИначеЕсли Элемент.Тип = "КнопкаФормы" Тогда
				
				ЭлементФормы.ИмяКоманды = Элемент.Имя;
				
			Иначе
				
				ЭлементФормы.ПутьКДанным  = Элемент.ПутьКДанным;
				
				Если  Элемент.Тип = "ТаблицаФормы" Тогда
					
					ЭлементФормы.Отображение = Элемент.ВидПоляФормы;
					
				Иначе
					
					ВидСвойства = Неопределено;
					
					Если Элемент.Свойство("Вид", ВидСвойства) Тогда 
						
						ЭлементФормы.Вид = Элемент.Вид;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если Не РедактируемыеЭлементы = Неопределено Тогда 
		
		Для Каждого ТекЭлемент Из РедактируемыеЭлементы Цикл
			
			Назначение = ЭтаФорма[ТекЭлемент.Путь];
			
			ЭлементФормы = Назначение[ТекЭлемент.Имя];
			ЭлементФормы[ТекЭлемент.Свойство] = ТекЭлемент.Значение; 			
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры